<template>
    <div id="career" class="career">
        <div class="contents">
            <div>
                주식회사 스페서(2024.03~2024.05, 2개월)
                매장 공동 예약 플랫폼 개발 참여
                1. 네이버 지도 및 nCloud 지도 API 연동
                -nCloud 지도 API 중 direction5 서비스를 이용하여 geolocation을 이용해 가져온 사용자의 현재 위치에서 목적지 까지 차로 이동시 소요되는 시간을 계산하여 표시하는 기능 구현


                2. 매장 목록 페이지 구현 및 데이터 연동
                -SWR을 이용하여 매장 목록을 무한 스크롤 형식으로 구현
                -매장 목록을 불러올때 내 현재 위치를 기준으로 가까운 순으로 불러오도록 쿼리문 작성
                -매장 목록의 각 매장 별 이미지 위에 react-icon을 이용해 구현한 아이콘을 클릭하여 해당 매장을 선호 매장으로 등록 및 해제 기능 구현 및 DB 연동

                3. 매장 상세 페이지 일부 기능 구현
                -리뷰 등록, 수정, 삭제 기능 및 리뷰 작성시 별점 부여 기능 구현 및 DB 연동

                4. 전체 페이지에서 버그 수정 작업 위주 참여
            </div>
            <div>
                골프 조인 어플리케이션 프론트엔드 및 관리자 페이지 개발 (2023.01~2023.11)
                React Native 및 React를 이용한 골프 조인 어플리케이션 개발 참여
                1. 최근 5경기 스코어를 Chart.js를 이용하여 그래프 형식으로 조회 가능한 컴포넌트 구현
                2. 회원 가입/로그인 페이지 구현
                3. 골프 조인 기능 및 페이지 구현
                - 조인 생성 기능 구현 및 DB 연결
                - 조인 신청 기능 구현 및 DB 연결
                4. 커뮤니티 게시물 작성 및 조회 페이지 구현
                5. 클럽하우스(소모임) 항목 내가 작성한 게시물 및 댓글 목록 기능 구현
                6. 문의 작성 기능 구현

                Next.js를 이용한 관리자 페이지 개발 참여
                1. 회원 목록을 확인하고 관리할 수 있는 관리 페이지 구현
                - DB에서 회원 데이터를 추출하여 목록 형태로 조회하고 관리할 수 있는 페이지 구현
                2. 골프장 목록을 확인하고 관리할 수 있는 관리 페이지 구현
                - DB에서 골프장 데이터를 추출하여 목록 형태로 조회하고 관리할 수 있는 페이지 구현
                3. 클럽하우스 목록을 확인하고 관리할 수 있는 관리 페이지 구현
                - DB에서 클럽하우스 데이터를 추출하여 목록 형태로 조회하고 관리할 수 있는 페이지 구현
                4. Chart.js를 이용하여 일주일간 신규 가입자 및 앱 사용량을 확인 가능한 그래프 구현
                5. 문의 목록 확인 및 답변 기능 구현

                Vue2를 이용한 골프장 정보 등록 웹페이지 개선
                1. 네이버 지도 API로 구현된 골프장 홀 별 GPS 정보 등록 페이지에 카카오 지도 API를 추가하여 API를 전환하여 등록 할 수 있도록 개선
            </div>
            <div>
                Vue2를 이용한 데이터그랩 회사 소개 페이지 및 사내 그룹웨어 프론트엔드 개발 참여(2020.03~2022.01)
                1. 회사 소개 페이지 기능 구현 및 디자인 적용
                2. 그룹웨어 홈 일정표 디자인 적용
                3. CKEditor를 이용한 회의록 작성 페이지 구현
                4. 연차 등록 및 결재 시스템 구현
                5. 급여 명세서 등록 및 조회 페이지 구현

                Vue2를 이용한 온라인 게임 전적 조회 사이트 THIS.GG 및 이스포츠 경기 조회 사이트 THIS.SPO 프론트엔드 개발 및 유지 보수 참여(2020.03~2023.01)
                1. 온라인 게임 리그 오브 레전드 및 이터널 리턴 전적 조회 페이지 구현
                - 검색한 플레이어의 최근 게임 결과를 목록으로 조회 가능한 페이지 구현
                *API연동을 통해 가져온 데이터를 분석하여 각 게임 마다 검색한 플레이어가 사용한 캐릭터 및 아이템 목록 및 특성 등을 아이콘으로 간략하게 표시
                - 연동된 api를 이용하여 선택한 게임의 인게임 결과 데이터를 조회할 수 있는 페이지 구현
                *API연동을 통해 가져온 데이터를 분석하여 선택한 게임에 참여한 모든 플레이어가 사용한 캐릭터 및 아이템, 스킬 정보 등을 표시하며 각 아이콘에 마우스를 올릴 경우 해당 아이콘의 세부 데이터를 모달 창을 이용하여 표시

                2. 커뮤니티 페이지 구현
                - CKEditor를 이용한 게시글 작성 페이지 제작
                - 게시판 페이지네이션 기능 구현
                - filter를 이용하여 카테고리 분류 기능 구현
                - sql쿼리를 이용하여 게시물 검색 기능 구현

                3. 클랜 (소모임) 기능 구현
                - 클랜 생성 기능 및 페이지 구현
                - 클랜 가입 및 탈퇴 기능 구현
                - 클랜 관리자 기능 구현
                - 클랜별 게시판 기능 및 페이지 구현

                4. 이스포츠 경기 결과 조회 사이트 THIS.SPO 프론트엔드 개발 및 유지 보수 참여
                - 게임 전적 조회 기능을 이용한 이스포츠 경기 결과 목록 페이지 제작
                - 게임 전적 조회 기능을 이용한 이스포츠 경기 결과 상세 페이지 제작
            </div>
        </div>
    </div>
</template>

<script>
    export default {
        
    }
</script>

<style lang="scss" scoped>
</style>